## Staging: database-tools
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 1 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.blazer_execution_role_policy will be destroyed
  # (because aws_iam_policy.blazer_execution_role_policy is not in configuration)
  - resource "aws_iam_policy" "blazer_execution_role_policy" {
      - arn       = "arn:aws:iam::239043911459:policy/blazer_execution_role_policy" -> null
      - id        = "arn:aws:iam::239043911459:policy/blazer_execution_role_policy" -> null
      - name      = "blazer_execution_role_policy" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPATPKBAT4R4D5Q75VOI" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # aws_iam_policy.blazer_task_role_policy will be created
  + resource "aws_iam_policy" "blazer_task_role_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "blazer_task_role_policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:DescribeParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.blazer_execution_role_actions will be destroyed
  # (because aws_iam_role_policy_attachment.blazer_execution_role_actions is not in configuration)
  - resource "aws_iam_role_policy_attachment" "blazer_execution_role_actions" {
      - id         = "blazer_execution_role-20221014152515199500000002" -> null
      - policy_arn = "arn:aws:iam::239043911459:policy/blazer_execution_role_policy" -> null
      - role       = "blazer_execution_role" -> null
    }

  # aws_iam_role_policy_attachment.blazer_task_role_actions will be created
  + resource "aws_iam_role_policy_attachment" "blazer_task_role_actions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "blazer-ecs-task"
    }

  # aws_security_group.blazer will be updated in-place
  ~ resource "aws_security_group" "blazer" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ egress                 = (sensitive)
        id                     = "sg-07ef3ef90b613aea1"
        name                   = "blazer"
      + name_prefix            = ""
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>